H1steria/hx-esp32-cam-fpv/components/air/main.cpp
//#include <Arduino.h>
#include <algorithm>

#include "esp_camera.h"
//#include "EEPROM.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_wifi.h"
//#include <driver/adc.h>
//#include "esp_adc_cal.h"
#include "esp_wifi_types.h"
#include "driver/sdmmc_host.h"
#include "driver/sdmmc_defs.h"
#include "sdmmc_cmd.h"
#include "esp_vfs_fat.h"
//#include "esp_wifi_internal.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "esp_private/wifi.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
#include "esp_mac.h"
//#include "bt.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/uart.h"
#include "driver/i2c.h"
#include <unistd.h>
#include <fcntl.h>
#include "esp_random.h"

#include "fec_codec.h"
#include "packets.h"
#include "safe_printf.h"
#include "structures.h"
#include "crc.h"
#include "driver/gpio.h"
#include "main.h"
#include "queue.h"
#include "circular_buffer.h"

#include "ll_cam.h" // cam_obj_t defination, used in camera_data_available

#include "wifi.h"
#include "nvs_args.h"

#include "osd.h"
#include "msp.h"
#include "avi.h"

#include "jpeg_parser.h"
#include "util.h"

#include "hx_mavlink_parser.h"

static int s_stats_last_tp = -10000;
static int s_last_osd_packet_tp = -10000;
static int s_last_config_packet_tp = -10000;
static int64_t s_last_report_packet_tp = -5000;

#define MJPEG_PATTERN_SIZE 512 

/////////////////////////////////////////////////////////////////////////

static size_t s_video_frame_data_size = 0;
static uint32_t s_video_frame_index = 0;
static uint8_t s_video_part_index = 0;
static bool s_video_frame_started = false;
static size_t s_video_full_frame_size = 0;
static uint8_t s_osdUpdateCounter = 0;
static bool s_lastByte_ff = false;

static int s_actual_capture_fps = 0;
static int s_actual_capture_fps_expected = 0;

static int s_quality = 20;
static float s_quality_framesize_K1 = 0; //startup from minimum quality to decrease pressure
static float s_quality_framesize_K2 = 1;
static float s_quality_framesize_K3 = 1;
static int s_max_frame_size = 0;
static int s_sharpness = 20;

static int64_t s_video_last_sent_tp = esp_timer_get_time();
static int64_t s_video_target_frame_dt = 0;
static uint8_t s_max_wlan_outgoing_queue_usage = 0;
static uint8_t s_min_wlan_outgoing_queue_usage_seen = 0;

static int64_t s_last_seen_config_packet = esp_timer_get_time();;

static int64_t s_restart_time = 0;
static int64_t s_wifi_ovf_time = 0;

extern WIFI_Rate s_wlan_rate;

bool SDError = false;
uint16_t SDTotalSpaceGB16 = 0;
uint16_t SDFreeSpaceGB16 = 0;
static uint8_t cam_ovf_count = 0;
static float s_camera_temperature = 0;

int32_t s_dbg;
uint16_t s_framesCounter = 0;

static bool s_initialized = false;

static uint16_t s_air_device_id;
static uint16_t s_connected_gs_device_id = 0;

static int64_t s_accept_connection_timeout_ms = 0;

/////////////////////////////////////////////////////////////////////////

static int s_uart_verbose = 1;

#define LOG(...) do { if (s_uart_verbose > 0) SAFE_PRINTF(__VA_ARGS__); } while (false) 

/////////////////////////////////////////////////////////////////////////

sdmmc_card_t* card = nullptr;

static bool s_air_record = false;

static bool s_camera_stopped = false;
static bool s_camera_stopped_requested = false;

static uint64_t s_shouldRestartRecording;

HXMavlinkParser mavlinkParserIn(true);

// DHT11 data
static float s_dht11_humidity = 0.0;
static float s_dht11_temperature = 0.0;
static bool s_dht11_data_valid = false;

//=============================================================================================
//=============================================================================================
#ifdef GPIO_CONTROL_PIN
static bool s_gpio_control_state = false;
#endif

static bool s_i2c_initialized = false;

//=============================================================================================
//=============================================================================================
esp_err_t i2c_master_init()
{
    if (s_i2c_initialized) return ESP_OK;

    i2c_config_t conf = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = I2C_SDA_PIN,
        .scl_io_num = I2C_SCL_PIN,
        .sda_pullup_en = GPIO_PULLUP_ENABLE,
        .scl_pullup_en = GPIO_PULLUP_ENABLE,
        .master = {
            .clk_speed = I2C_MASTER_FREQ_HZ
        },
        .clk_flags = 0
    };
    
    // Uninstall driver first if it was previously installed
    i2c_driver_delete(I2C_MASTER_NUM);
    
    esp_err_t err = i2c_param_config(I2C_MASTER_NUM, &conf);
    if (err != ESP_OK) {
        LOG("Failed to configure I2C parameters: %s\n", esp_err_to_name(err));
        return err;
    }
    
    // Install driver with 0 buffer sizes for master mode
    err = i2c_driver_install(I2C_MASTER_NUM, conf.mode, 0, 0, 0);
    if (err != ESP_OK) {
        LOG("Failed to install I2C driver: %s\n", esp_err_to_name(err));
        return err;
    }

    s_i2c_initialized = true;
    LOG("I2C Master initialized - SDA:%d SCL:%d Freq:%dHz\n", I2C_SDA_PIN, I2C_SCL_PIN, I2C_MASTER_FREQ_HZ);
    return ESP_OK;
}

void initialize_i2c()
{
    esp_err_t ret = i2c_master_init();
    if (ret != ESP_OK) {
        LOG("Failed to initialize I2C master: %s\n", esp_err_to_name(ret));
    }
}

void send_i2c_command(uint8_t command)
{
    if (!s_i2c_initialized) {
        initialize_i2c();
        if (!s_i2c_initialized) {
            LOG("Failed to initialize I2C\n");
            return;
        }
    }

    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (I2C_SLAVE_ADDR << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, command, true);
    i2c_master_stop(cmd);
    
    // Use a longer timeout to ensure reliable communication
    esp_err_t ret = i2c_master_cmd_begin(I2C_MASTER_NUM, cmd, pdMS_TO_TICKS(100));
    i2c_cmd_link_delete(cmd);
    
    if (ret == ESP_OK) {
        LOG("I2C command %d sent successfully\n", command);
    } else {
        LOG("Failed to send I2C command %d, error: %s\n", command, esp_err_to_name(ret));
        // Try to reinitialize I2C on failure
        s_i2c_initialized = false;
        initialize_i2c();
    }
    
    // Add a small delay after I2C communication to reduce interference
    // Only delay if camera is not actively capturing
    if (!s_video_frame_started) {
        vTaskDelay(5 / portTICK_PERIOD_MS);
    }
}

// Function to read DHT11 data from I2C slave
esp_err_t read_dht11_data(float* humidity, float* temperature) {
    TickType_t start_time = xTaskGetTickCount();
    
    if (!s_i2c_initialized) {
        LOG("DHT11 Read - I2C not initialized, initializing\n");
        initialize_i2c();
        if (!s_i2c_initialized) {
            LOG("DHT11 Read - Failed to initialize I2C\n");
            return ESP_FAIL;
        }
    }

    uint8_t data_buffer[9]; // 4 bytes for humidity + 4 bytes for temperature + 1 byte for valid flag

    // Read data from slave
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (I2C_SLAVE_ADDR << 1) | I2C_MASTER_READ, true);
    i2c_master_read(cmd, data_buffer, sizeof(data_buffer), I2C_MASTER_LAST_NACK);
    i2c_master_stop(cmd);
    
    esp_err_t ret = i2c_master_cmd_begin(I2C_MASTER_NUM, cmd, pdMS_TO_TICKS(100));
    i2c_cmd_link_delete(cmd);
    
    if (ret == ESP_OK) {
        // Log raw data for debugging
        LOG("DHT11 Read - Raw data received: ");
        for (int j = 0; j < sizeof(data_buffer); j++) {
            LOG("%02X ", data_buffer[j]);
        }
        LOG("\n");

        // Check data validity flag (last byte)
        if (data_buffer[8] == 0) {
            LOG("DHT11 Read - Data not valid from auxiliary unit\n");
            LOG("%d-%d\n",data_buffer[7], data_buffer[8]);
            return ESP_ERR_INVALID_STATE;
        }

        // Convert bytes to float values
        memcpy(humidity, &data_buffer[0], sizeof(float));
        memcpy(temperature, &data_buffer[4], sizeof(float));
        
        TickType_t end_time = xTaskGetTickCount();
        LOG("DHT11 Read - Success: H=%d%%, T=%d°C (took %d ms)\n", 
            (int)(*humidity), (int)(*temperature), (int)((end_time - start_time) * portTICK_PERIOD_MS));

        return ESP_OK;
    }
    
    LOG("DHT11 Read - Failed to read data, error: %s\n", esp_err_to_name(ret));
    s_i2c_initialized = false;
    return ret;
}


//=============================================================================================
//=============================================================================================
void initialize_gpio_control_pin()
{
#ifdef GPIO_CONTROL_PIN
    gpio_config_t io_conf;
    // io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.pin_bit_mask = 1ULL << GPIO_CONTROL_PIN;
    io_conf.mode = GPIO_MODE_OUTPUT;
    // io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    // io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);
    
    gpio_set_level(GPIO_CONTROL_PIN, 0); // Start with GPIO off
    s_gpio_control_state = false;
    LOG("GPIO control initialized on pin %d, state: OFF\n", GPIO_CONTROL_PIN);
#endif
}

//=============================================================================================
//=============================================================================================
void initialize_i2c_at_boot()
{
    // Initialize I2C early in the boot process
    LOG("Initializing I2C at boot...\n");
    esp_err_t ret = i2c_master_init();
    if (ret == ESP_OK && s_i2c_initialized) {
        LOG("I2C successfully initialized at boot\n");
    } else {
        LOG("Failed to initialize I2C at boot: %s\n", esp_err_to_name(ret));
    }
}

//=============================================================================================
void set_gpio_control_pin(bool enabled)
{
#ifdef GPIO_CONTROL_PIN
    gpio_set_level(GPIO_CONTROL_PIN, enabled ? 1 : 0);
    s_gpio_control_state = enabled;
    LOG("GPIO control pin %d set to %s\n", GPIO_CONTROL_PIN, enabled ? "HIGH" : "LOW");
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t micros()
{
    return esp_timer_get_time();
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t millis()
{
    return esp_timer_get_time() / 1000ULL;
}
//=============================================================================================
//=============================================================================================
void set_status_led(bool enabled)
{
#ifdef STATUS_LED_PIN
    gpio_set_level(STATUS_LED_PIN, enabled ? STATUS_LED_ON : STATUS_LED_OFF);
#endif    

#ifdef ESP32CAM_FLASH_LED_PIN
    enable_esp32cam_flash_led_pin(enabled);
#endif    
}

//=============================================================================================
//=============================================================================================
bool getButtonState()
{
#ifdef REC_BUTTON_PIN
    return gpio_get_level((gpio_num_t)REC_BUTTON_PIN) == 0;
#endif


#ifdef ESP32CAM_FLASH_LED_PIN
    return read_esp32cam_flash_led_pin();
#endif

