H1steria/hx-esp32-cam-fpv/components/air/main.cpp
    return false;
}

//////////////////////////////////////////////////////////////////////////////
static bool s_recv_ground2air_packet = false;

SemaphoreHandle_t s_serial_mux = xSemaphoreCreateBinary();

auto _init_result2 = []() -> bool
{
  xSemaphoreGive(s_serial_mux);
  return true;
}();

//=============================================================================================
//=============================================================================================
IRAM_ATTR void packet_received_cb(void* buf, wifi_promiscuous_pkt_type_t type)
{
    if (type == WIFI_PKT_DATA)
    {
        //LOG("data packet\n");
    }
    else if (type == WIFI_PKT_MGMT)
    {
        //LOG("management packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }
    else if (type == WIFI_PKT_MISC)
    {
        //LOG("misc packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }
    else if (type == WIFI_PKT_CTRL)
    {
        //LOG("misc packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }

    wifi_promiscuous_pkt_t *pkt = reinterpret_cast<wifi_promiscuous_pkt_t*>(buf);

    if (pkt->rx_ctrl.channel != s_ground2air_config_packet.dataChannel.wifi_channel)
    {
        //LOG("Packet received on wrong channel: %d, expected: %d\n", pkt->rx_ctrl.channel, s_ground2air_config_packet.dataChannel.wifi_channel);
        s_stats.inRejectedPacketCounter++;
        return;
    }    

    uint16_t len = pkt->rx_ctrl.sig_len;
    //s_stats.wlan_data_received += len;
    //s_stats.wlan_data_sent += 1;

    if (len <= WLAN_IEEE_HEADER_SIZE)
    {
        LOG("WLAN receive header error");
        s_stats.wlan_error_count++;
        return;
    }

    //LOG("Recv %d bytes\n", len);
    //LOG("Channel: %d\n", (int)pkt->rx_ctrl.channel);

    //uint8_t broadcast_mac[] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
    //LOG("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    uint8_t *data = pkt->payload;
    if (memcmp(data + 10, WLAN_IEEE_HEADER_GROUND2AIR + 10, 6) != 0)
    {
        //here we filter also AIR2GROUND packets from other air devices on the same channel
        s_stats.inRejectedPacketCounter++;
        return;
    }

    data += WLAN_IEEE_HEADER_SIZE;
    len -= WLAN_IEEE_HEADER_SIZE; //skip the 802.11 header

    if (len >= 4) 
    {
        len -= 4;
    } 
    else 
    {
        // Packet is too small after removing header and potential FCS
        //LOG("WLAN payload error - packet too small after header removal (%d bytes)\n", len);
        s_stats.wlan_error_count++;
        return;
    }

    size_t size = std::min<size_t>(len, WLAN_MAX_PAYLOAD_SIZE);

    auto res = s_fec_decoder.packetFilter.filter_packet( data, size );
    if ( res != PacketFilter::PacketFilterResult::Pass)
    {
        s_stats.inRejectedPacketCounter++;
        return;
    }

    s_stats.inPacketCounter++;
    s_stats.rssiDbm = -pkt->rx_ctrl.rssi;
    s_stats.noiseFloorDbm = -pkt->rx_ctrl.noise_floor;

    s_fec_decoder.lock();
    if (!s_fec_decoder.decode_data(data, size, false))
    {
        s_stats.wlan_received_packets_dropped++;
    }
    s_fec_decoder.unlock();

    s_stats.wlan_data_received += len;
}

//=============================================================================================
//=============================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR bool processSetting(const char* valueName, int fromValue, int toValue, const char *nvsName )
{
    if ( fromValue != toValue )
    {
        LOG("%s changed from %d to %d\n", valueName, fromValue, toValue );
        if ( !!nvsName ) 
        {
            nvs_args_set(nvsName, (uint32_t)toValue);
        }
        return true;
    }
    return false;
}

//=============================================================================================
//=============================================================================================
//process settings not related to camera sensor setup
static void handle_ground2air_config_packetEx1(Ground2Air_Config_Packet& src)
{
    s_recv_ground2air_packet = true;
    s_accept_connection_timeout_ms = 0;

    int64_t t = esp_timer_get_time();
    s_last_seen_config_packet = t;
    
    Ground2Air_Config_Packet& dst = s_ground2air_config_packet;

    if ( processSetting( "Wifi rate", (int)dst.dataChannel.wifi_rate, (int)src.dataChannel.wifi_rate, "rate") )
    {
        ESP_ERROR_CHECK(set_wifi_fixed_rate(src.dataChannel.wifi_rate));
    }
    
    if ( processSetting( "Wifi power", dst.dataChannel.wifi_power, src.dataChannel.wifi_power, NULL ) )
    {
        ESP_ERROR_CHECK(set_wlan_power_dBm(src.dataChannel.wifi_power));
    }

    if ( processSetting( "FEC codec N", dst.dataChannel.fec_codec_n, src.dataChannel.fec_codec_n, "fec_n") )
    {
        s_fec_encoder.switch_n( src.dataChannel.fec_codec_n );
    }
    
    if ( processSetting( "Wifi channel", dst.dataChannel.wifi_channel, src.dataChannel.wifi_channel, "channel" ) )
    {
        ESP_ERROR_CHECK(esp_wifi_set_channel((int)src.dataChannel.wifi_channel, WIFI_SECOND_CHAN_NONE));
    }

    if ( processSetting( "Target FPS", dst.camera.fps_limit, src.camera.fps_limit, NULL) )
    {
        if (src.camera.fps_limit == 0)
            s_video_target_frame_dt = 0;
        else
            s_video_target_frame_dt = 1000000 / src.camera.fps_limit;
    }

    processSetting( "AutostartRecord", dst.dataChannel.autostartRecord, src.dataChannel.autostartRecord, "autostartRecord" );

    processSetting( "CameraStopChannel", dst.dataChannel.cameraStopChannel, src.dataChannel.cameraStopChannel, "cameraStopCH" );

    processSetting( "mavlink2mspRC",  dst.dataChannel.mavlink2mspRC, src.dataChannel.mavlink2mspRC, "mavlink2mspRC" );

    if ( s_restart_time == 0 )
    {
        if ( dst.dataChannel.air_record_btn != src.dataChannel.air_record_btn )
        {
            s_air_record = !s_air_record;
            //dst.dataChannel.air_record_btn = src.dataChannel.air_record_btn;
        }
    }

    dst = src;
}

//=============================================================================================
//=============================================================================================
//process settings related to camera sensor setup
void handle_ground2air_config_packetEx2(bool forceCameraSettings)
{
    Ground2Air_Config_Packet& src = s_ground2air_config_packet;
    Ground2Air_Config_Packet& dst = s_ground2air_config_packet2;

    sensor_t* s = esp_camera_sensor_get();

#ifdef SENSOR_OV5640
    //on ov5640, aec2 is not aec dsp but "night vision" mode which decimate framerate dynamically
    src.camera.aec2 = false;
#endif

    bool resolutionChanged = (dst.camera.resolution != src.camera.resolution);
    bool ov2640HighFPSChanged = (src.camera.ov2640HighFPS != dst.camera.ov2640HighFPS );
    bool ov5640HighFPSChanged = (src.camera.ov5640HighFPS != dst.camera.ov5640HighFPS );
    if ( forceCameraSettings || resolutionChanged || ov2640HighFPSChanged || ov5640HighFPSChanged )
    {
        s_shouldRestartRecording =  esp_timer_get_time() + 1000000;
        LOG("Camera resolution changed from %d to %d\n", (int)dst.camera.resolution, (int)src.camera.resolution);

#ifdef SENSOR_OV5640
        s->set_colorbar(s, src.camera.ov5640HighFPS?1:0);
#else
        if ( src.camera.ov2640HighFPS && 
            ((src.camera.resolution == Resolution::VGA) ||
            (src.camera.resolution == Resolution::VGA16) ||
            (src.camera.resolution == Resolution::SVGA16)) 
            )
        {
            s->set_xclk( s, LEDC_TIMER_0, 16 );
        }
        else
        {
            s->set_xclk( s, LEDC_TIMER_0, 12 );
        }
#endif

