H1steria/hx-esp32-cam-fpv/components/air/main.cpp
    LOG("Unpair from GS\n" );

    s_accept_connection_timeout_ms = 0;
}

//===========================================================================================
//===========================================================================================
static void handle_ground2air_config_packet(Ground2Air_Config_Packet& src)
{
    if ( s_connected_gs_device_id == 0 ) 
    {
        if ( src.airDeviceId == s_air_device_id )
        {
            //accept connection with GS. This GS was connected to this camera before. 
            //Camera rebooted?
            acceptConnectionWithGS( src.gsDeviceId );
        }
        else
        {
            return;
        }
    }

    //handle settings not related to camera sensor setup.
    //camera sensor settings are processed in camera_data_available() callback
    handle_ground2air_config_packetEx1(src);
}

//===========================================================================================
//===========================================================================================
IRAM_ATTR static void handle_ground2air_connect_packet(Ground2Air_Config_Packet& src)
{
    if ( s_connected_gs_device_id == 0 )
    {
        acceptConnectionWithGS( src.gsDeviceId );
    }
}

static void init_camera();

//===========================================================================================
//===========================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR static void handle_ground2air_control_packet(Ground2Air_Control_Packet& src)
{
    // Handle flash command (previously gpio_control_btn)
    #ifdef GPIO_CONTROL_PIN
    if (s_restart_time == 0)
    {
        // Only activate GPIO when flash command is received, don't change state for other commands
        if (src.command == I2C_CMD_FLASH)
        {
            // Activate GPIO for flash command
            set_gpio_control_pin(true);
            LOG("Flash activated\n");
        }
    }
    #endif

    // Handle movement commands and retransmit via I2C
    if (s_restart_time == 0)
    {
        switch (src.command)
        {
            case I2C_CMD_FORWARD: // Forward
                send_i2c_command(I2C_CMD_FORWARD);
                LOG("Forward command sent via I2C\n");
                break;
            case I2C_CMD_BACKWARD: // Backward
                send_i2c_command(I2C_CMD_BACKWARD);
                LOG("Backward command sent via I2C\n");
                break;
            case I2C_CMD_RIGHT: // Right
                send_i2c_command(I2C_CMD_RIGHT);
                LOG("Right command sent via I2C\n");
                break;
            case I2C_CMD_LEFT: // Left
                send_i2c_command(I2C_CMD_LEFT);
                LOG("Left command sent via I2C\n");
                break;
            case I2C_CMD_FLASH: // Flash
                // Already handled above
                break;
            default:
                LOG("Unknown command received: %d\n", src.command);
                break;
        }
    }
}

//===========================================================================================
//===========================================================================================
// __attribute__((optimize("Os")))
// IRAM_ATTR static void handle_ground2air_data_packet(Ground2Air_Data_Packet& src)
// {
// }

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_video_packet(bool last)
{
    s_stats.video_data += s_video_frame_data_size;

    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data)
    {
        LOG("no data buf!\n");
    }

    Air2Ground_Video_Packet& packet = *(Air2Ground_Video_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Video;
    packet.resolution = s_ground2air_config_packet.camera.resolution;
    packet.frame_index = s_video_frame_index;
    packet.part_index = s_video_part_index;
    packet.last_part = last ? 1 : 0;
    packet.size = s_video_frame_data_size + sizeof(Air2Ground_Video_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Video_Packet));
    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
    }
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_osd_packet()
{
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data)
    {
        LOG("no data buf!\n");
        return ;
    }

    Air2Ground_OSD_Packet& packet = *(Air2Ground_OSD_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::OSD;
    packet.size = sizeof(Air2Ground_OSD_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;

    packet.stats.curr_wifi_rate = (uint8_t)s_wlan_rate;

    packet.stats.wifi_queue_min = s_min_wlan_outgoing_queue_usage_seen;
    packet.stats.wifi_queue_max = s_max_wlan_outgoing_queue_usage;
    packet.stats.air_record_state = s_air_record ? 1 : 0;

    packet.stats.wifi_ovf = 0;
    if ( s_wifi_ovf_time > 0 )
    {
        int64_t t = esp_timer_get_time();
        t -= s_wifi_ovf_time;
        if ( t < 1000000 )
        {
            packet.stats.wifi_ovf = 1;
        }
        else
        {
            s_wifi_ovf_time = 0;
        }
    }
    
    packet.stats.SDFreeSpaceGB16 = SDFreeSpaceGB16;
    packet.stats.SDTotalSpaceGB16 = SDTotalSpaceGB16;
    packet.stats.curr_quality = s_quality;

