H1steria/hx-esp32-cam-fpv/components/air/main.cpp
    packet.stats.temperature = (uint8_t)(s_camera_temperature + 0.5f);
    packet.stats.overheatTrottling = 0;

    if ( s_last_stats.RCPeriodMaxMS < 0 )
    {
        packet.stats.RCPeriodMax = 0;
    }
    else if ( s_last_stats.RCPeriodMaxMS == 0 )
    {
        packet.stats.RCPeriodMax = 1;
    }
    else if ( s_last_stats.RCPeriodMaxMS <= 100 )
    {
        packet.stats.RCPeriodMax = s_last_stats.RCPeriodMaxMS;
    }
    else 
    {
        //s_last_stats.RCPeriodMaxMS can not be > 1000
        //1000/10 + 101 < 255
        packet.stats.RCPeriodMax = s_last_stats.RCPeriodMaxMS / 10 + 101;   
    }

#ifdef SENSOR_OV5640
    packet.stats.isOV5640 = 1;
#else
    packet.stats.isOV5640 = 0;
#endif    

    packet.stats.outPacketRate = s_last_stats.outPacketCounter;
    packet.stats.inPacketRate = s_last_stats.inPacketCounter;
    packet.stats.inRejectedPacketRate = s_last_stats.inRejectedPacketCounter;
    packet.stats.rssiDbm = s_last_stats.rssiDbm;
    packet.stats.noiseFloorDbm = s_last_stats.noiseFloorDbm;
    packet.stats.captureFPS = s_actual_capture_fps;
    packet.stats.cam_frame_size_min = s_last_stats.camera_frame_size_min;
    packet.stats.cam_frame_size_max = s_last_stats.camera_frame_size_max;
    packet.stats.cam_ovf_count = cam_ovf_count;
    packet.stats.inMavlinkRate = s_last_stats.in_telemetry_data;
    packet.stats.outMavlinkRate = s_last_stats.out_telemetry_data;

    packet.stats.suspended = s_camera_stopped != 0;


    memcpy( &packet.buffer, g_osd.getBuffer(), OSD_BUFFER_SIZE );
    
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_OSD_Packet));

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
    }
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_config_packet()
{
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);
    if( !packet_data )
    {
        LOG("no data buf!\n");
        return;
    }

    Air2Ground_Config_Packet& packet = *(Air2Ground_Config_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Config;
    packet.size = sizeof(Air2Ground_Config_Packet);
    packet.dataChannel = s_ground2air_config_packet.dataChannel;
    packet.camera = s_ground2air_config_packet.camera;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;

    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Config_Packet));

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
    }
}
//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_report_packet()
{
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);
    if( !packet_data )
    {
        LOG("no data buf!\n");
        return;
    }

    Air2Ground_Report_Packet& packet = *(Air2Ground_Report_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Report; // Using Report type for report packets
    packet.size = sizeof(Air2Ground_Report_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;

    // Fill in DHT11 data
    packet.temperature = s_dht11_temperature;
    packet.humidity = s_dht11_humidity;
    packet.data_valid = s_dht11_data_valid ? 1 : 0;

    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Report_Packet));

    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
    }
}

IRAM_ATTR void handle_dht11_read_and_send()
{
    // Only proceed if 5 seconds have passed since the last report packet was sent
    if (millis() - s_last_report_packet_tp > 5000) {
        float dht11_humidity_local = 0.0;
        float dht11_temperature_local = 0.0;
        
        esp_err_t result = read_dht11_data(&dht11_humidity_local, &dht11_temperature_local);
        if (result == ESP_OK) {
            s_dht11_humidity = dht11_humidity_local;
            s_dht11_temperature = dht11_temperature_local;
            s_dht11_data_valid = true;
            LOG("DHT11 data - Humidity: %d%%, Temperature: %d°C\n", (int)dht11_humidity_local, (int)dht11_temperature_local);
        } else {
            s_dht11_data_valid = false;
            LOG("Failed to read DHT11 data: %s\n", esp_err_to_name(result));
        }

        // Always attempt to send the report packet if connected, regardless of read success
        // The data_valid flag in the packet will indicate if the data is fresh/valid
        if (s_connected_gs_device_id != 0) {
            send_air2ground_report_packet();
        }
        s_last_report_packet_tp = millis(); // Reset timer after a full cycle (read attempt + send attempt)
    }
}
//=============================================================================================
//=============================================================================================
constexpr size_t MAX_VIDEO_DATA_PAYLOAD_SIZE = AIR2GROUND_MTU - sizeof(Air2Ground_Video_Packet);

static const int WifiRateBandwidth[] = 
{
    2*1024*125, // 0 - RATE_B_2M_CCK,
    2*1024*125, // 1 - RATE_B_2M_CCK_S,
    5*1024*125, // 2 - RATE_B_5_5M_CCK,
    5*1024*125, // 3 - RATE_B_5_5M_CCK_S,
    11*1024*125, // 4 - RATE_B_11M_CCK,
    11*1024*125, // 5 - RATE_B_11M_CCK_S,

    6*1024*125, // 6 - RATE_G_6M_ODFM,
    9*1024*125, // 7 - RATE_G_9M_ODFM,
    12*1024*125, // 8 - RATE_G_12M_ODFM,
    18*1024*125, // 9 - RATE_G_18M_ODFM,
    24*1024*125,  // 10 - RATE_G_24M_ODFM,
    36*1024*125,  // 11 - RATE_G_36M_ODFM,
    48*1024*125,  // 12 - RATE_G_48M_ODFM,
    54*1024*125,  // 13 - RATE_G_54M_ODFM,

