H1steria/hx-esp32-cam-fpv/components/air/main.cpp
                count -= c;
                s_video_frame_data_size += c;
                s_video_full_frame_size += c;

#ifdef BOARD_ESP32CAM
                //ESP32 - sample offset: 2, stride: 4
                size_t c8 = c >> 3;
                
                for (size_t i = c8; i > 0; i--)
                {
                    const uint8_t* src1  = src + 3*4;
                    uint32_t temp;

                    temp = *src1; 
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;

                    *(uint32_t*)ptr = temp;
                    ptr += 4;

                    src1  = src + 7*4;

                    temp = *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    
                    src += 8*4;

                    *(uint32_t*)ptr = temp;
                    ptr+=4;

                    /*
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    */
                }
                for (size_t i = c - (c8 << 3); i > 0; i--)
                {
                    *ptr++ = *src; src += stride;
                }
#endif

                if (s_video_frame_data_size == MAX_VIDEO_DATA_PAYLOAD_SIZE) 
                {
                    //LOG("Flush: %d %d\n", s_video_frame_index, s_video_frame_data_size);
                    //if wifi send queue was overloaded, do not send frame data till the end of the frame. 
                    //Frame is lost anyway. 
                    //Let fec_encoder and wifi to send leftover and start with emtpy queues at the next camera frame.
                    if (!s_encoder_output_ovf_flag)
                    {
                        send_air2ground_video_packet(false);
                    }
                    s_video_frame_data_size = 0;
                    s_video_part_index++;
                }

                //LOG("Add: %d %d %d %d\n", s_video_frame_index, s_video_part_index, count, s_video_frame_data_size);

            }  //while count>0
        }  //s_frame_started

        //////////////////

        if (last)  //note: can occur multiple times during frame
        {
            //end of frame - send leftover
            if ( s_video_frame_started )
            {
                s_video_frame_started = false;

                s_stats.video_frames++;
                s_stats.video_frames_expected++;

                //LOG("Finish: %d %d\n", s_video_frame_index, s_video_frame_data_size);
                if ((s_video_frame_data_size > 0) && !s_encoder_output_ovf_flag) //left over
                {
                    send_air2ground_video_packet(true);
                }

                if ( s_video_full_frame_size  < 2000)
                {
                    //probably broken frame - too small
                    cam_ovf_count++;
                    s_stats.video_frames_expected++;
                }

                //end of frame - stats, camera settings, osd, mavlink
                if ( s_video_full_frame_size > 0)
                {
                    if ( (s_stats.camera_frame_size_min == 0) || (s_stats.camera_frame_size_min > s_video_full_frame_size) )
                    {
                        s_stats.camera_frame_size_min = s_video_full_frame_size;
                    } 

                    if ( s_stats.camera_frame_size_max < s_video_full_frame_size )
                    {
                        s_stats.camera_frame_size_max = s_video_full_frame_size;
                    } 

                    recalculateFrameSizeQualityK(s_video_full_frame_size);
                    applyAdaptiveQuality();

                    s_stats.fec_spin_count += s_fec_spin_count;
                    s_fec_spin_count = 0;

                    handle_ground2air_config_packetEx2(false);

                    if ( !g_osd.isLocked() && (g_osd.isChanged() || (s_osdUpdateCounter == 15)) )
                    {
                        send_air2ground_osd_packet();
                        s_osdUpdateCounter = 0;
                    }
                    else
                    {
                        s_osdUpdateCounter++;
                    }

                    // Call the new DHT11 logic here
                    handle_dht11_read_and_send();

                    int64_t dt = millis() - s_last_config_packet_tp;
                    if ( dt > 500 ) 
                    {
                        s_last_config_packet_tp = millis();
                        send_air2ground_config_packet();
                    }

                }

                s_video_frame_index++;
            }
        }

        //zero start of the DMA block
        for ( int i = 0; i < 16; i++ )
        {
            *clrSrc = 0;
            clrSrc += stride;
        }

        s_fec_encoder.unlock();
    }

    return count;
}

//=============================================================================================
//=============================================================================================
static void init_camera()
{
    printf("Init camera...\n");

    camera_config_t config;
    config.ledc_channel = LEDC_CHANNEL_0;
    config.ledc_timer = LEDC_TIMER_0;
    config.pin_d0 = Y2_GPIO_NUM;
    config.pin_d1 = Y3_GPIO_NUM;
    config.pin_d2 = Y4_GPIO_NUM;
    config.pin_d3 = Y5_GPIO_NUM;
    config.pin_d4 = Y6_GPIO_NUM;
    config.pin_d5 = Y7_GPIO_NUM;
    config.pin_d6 = Y8_GPIO_NUM;
    config.pin_d7 = Y9_GPIO_NUM;
    config.pin_xclk = XCLK_GPIO_NUM;
    config.pin_pclk = PCLK_GPIO_NUM;
    config.pin_vsync = VSYNC_GPIO_NUM;
    config.pin_href = HREF_GPIO_NUM;
    config.pin_sccb_sda = SIOD_GPIO_NUM;
    config.pin_sccb_scl = SIOC_GPIO_NUM;
    config.pin_pwdn = PWDN_GPIO_NUM;
    config.pin_reset = RESET_GPIO_NUM;
#ifdef SENSOR_OV5640    
    config.xclk_freq_hz = 20000000;
#else
    config.xclk_freq_hz = 12000000;  //real frequency will be 80Mhz/6 = 13,333Mhz and we use clk2x
#endif    
    config.pixel_format = PIXFORMAT_JPEG;
    config.frame_size = FRAMESIZE_SVGA;
    config.jpeg_quality = 63;  //start from lowest quality to decrease pressure at startup
    config.fb_count = 2;
    config.grab_mode = CAMERA_GRAB_LATEST;
    config.fb_location = CAMERA_FB_IN_DRAM;
    config.data_available_callback = camera_data_available;

    // camera init
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK)
    {
        LOG("Camera init failed with error 0x%x", err);
        return;
    }
}

//=============================================================================================
//=============================================================================================
uint16_t generateDeviceId() 
{
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA); // Read base MAC address
    uint16_t id = 0;

    // Fold MAC address into 16 bits
    id ^= (mac[0] << 8) | mac[1];
    id ^= (mac[2] << 8) | mac[3];
    id ^= (mac[4] << 8) | mac[5];

    return id;
}
//=============================================================================================
//=============================================================================================
void readConfig()
{
    s_air_device_id = (uint16_t)nvs_args_read( "deviceId", 0 );
    if( s_air_device_id == 0 )
    {
        s_air_device_id = generateDeviceId();
        nvs_args_set("deviceId", s_air_device_id);
    }
    LOG("Air Device ID: 0x%04x\n", (int)s_air_device_id);

